# [KDT] ch1 데이타분석용 파이썬 이해

In [1]:
import os
os.getcwd()

'C:\\Users\\김진산\\Desktop\\AIStudy'

In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [3]:
pd.__version__

'1.3.4'

# 1. Numpy

In [4]:
#import numpy 
import numpy as np

In [5]:
# nd array 1차원
np.array([1,2,3,4,['a']])

array([1, 2, 3, 4, list(['a'])], dtype=object)

In [6]:
# nd array 2차원
np.arange(1,30,2)
np.array([[ 1,  3,  5,  7,  9, 11], [13, 15, 17, 19, 21, 23, 25, 27, 29]]).shape

(2,)

In [7]:
# nd array 3차원
np.array([[[ 1,  3,  5,  7,  9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29]]]).shape

(1, 1, 15)

### 1_1. ndarray의 데이터 타입

In [8]:
# int type
list1 = [1,2,3]
print(type(list1))
array1 = np.array(list1)
array1
print(type(array1))
print(array1, array1.dtype)

<class 'list'>
<class 'numpy.ndarray'>
[1 2 3] int32

In [9]:
# int type + object
list2 = [1,2,3,4.0,'test']
list2
array2 = np.array(list2)
print(array2, array2.dtype)
# int type + float

['1' '2' '3' '4.0' 'test'] <U32

In [10]:
# type 변환, astype('float'), astype('int')
array_int = np.array([1,2,3])
array_float = np.array([1.0,2.2,3.9])
array_float.dtype
array_int.dtype
array_int.astype('float').dtype
array_float.dtype
array_float.astype('datetime')
datetime

TypeError: data type 'datetime' not understood

### 1_2. ndarray를 편리하게 생성하기 - arange, zeros, ones

In [ ]:
# np.arange
sequence_array = np.arange(10)
sequence_array.dtype
sequence_array.shape

In [ ]:
#(3, 2) shape을 가지는 모든 원소가 0, dtype은 int32 인 ndarray 생성. 
zero_array = np.zeros((3,2), dtype='int')
zero_array
#(3, 2) shape을 가지는 모든 원소가 1인 ndarray 생성.
one_array = np.ones((3,2))
one_array

### 1_3. ndarray reshape

In [ ]:
# reshape
array1 = np.arange(10)
array1
# (2, 5) shape으로 변환
array2 = array1.reshape(2,5)
array2
#(5, 2) shape으로 변환
array3 = array1.reshape(5,2)
array3

In [ ]:
# reshape (X)
array2 = array1.reshape(4,3)
array2

In [ ]:
# reshape(-1)
array2 = array1.reshape(2,-1)
array2

In [ ]:
# reshape (X)

In [ ]:
# reshape (ndarray 차원변환) 
array1 = np.arange(8)
print("array1:\n",array1.tolist())
print("array1:\n",array1)
# 1차원 ndarray를 3차원 ndarray로 변환 
array3d = array1.reshape((2,2,2))
print("array3d:\n",array3d.tolist())
print("array3d:\n",array3d)
# 3차원 ndarray를 2차원 ndarray로 변환하되 칼럼갯수는 1 
array5 = array3d.reshape(-1,1)
print("array5:\n",array5.tolist())
print("array5:\n",array5)
# 1차원 ndarray를 2차원 ndarray로 변환화되 칼럼 갯수는 1 

# 3차원 ndarray를 1차원으로 변환

### 1_4. ndarray indexing

* 단일 값 추출 (1d array)

In [ ]:
# 1에서 부터 12 까지의 1차원 ndarray 생성 
arr = np.arange(12)
print('arr',arr)
arr[2]

In [ ]:
# array[-1] 맨 뒤값
arr[-1]

단일 값 추출 (2d array)

In [ ]:
# 실습 array 생성
arr12 = np.arange(12)
arr12
arr26 = arr12.reshape(2,6)
arr26

In [ ]:
# ndarray indexing
arr26[0,2]
arr26[1,3]

* 슬라이싱 - 연속된 인덱스상의 값을 추출하는 방식

In [ ]:
# 실습 array 생성

print('arr12=',arr12)
arr12[0:3]
arr12[3:]

In [ ]:
# 슬라이싱 1d
print('arr12=',arr12)
arr12[0:3]
arr12[3:]

In [ ]:
# 슬라이싱 2d
print('arr26=',arr26)
arr26[0:3,1:3]
arr26[:2, -1]

* 팬시 인덱싱 - 리스트나 ndarray로 인덱스 집합을 지정하는 방식

In [ ]:
# 실습 array 생성
arr_12 = np.arange(12)
print('arr_12\n', arr_12)
arr_26 = arr_12.reshape(2,6)
print('arr_26\n', arr_26)
arr_34 = arr_12.reshape(3,-1)
print('arr_34\n', arr_34)

In [ ]:
# 팬시 인덱싱
arr_34[[0,1],0:2]

* 불린 인덱싱- True, False 조건으로 인덱스 집합을 지정하는 방식

In [ ]:
# 실습 array 생성
arr_12 = np.arange(12)
print('arr_12\n', arr_12)

In [ ]:
# 불린 인덱싱
arr_12 > 4

In [ ]:
# 불린 인덱싱, boolean_indexes => boolean_indexes는 필터링에 활용
arr_12[arr_12 > 4]

In [ ]:
# arr_12를 2로 나눈 나머지가 짝수인가
np.mod(arr_12,2) == 0

In [ ]:
# arr_12에서 홀수만 추출(필터링)
boolean_indexer =[ True, False,  True, False,  True, False,  True, False,  True,
       False,  True, False]
arr_12[boolean_indexer]

연습문제 풀이

# 2. Pandas

### 2_1. DataFrames 생성

* pd.DataFrame()

In [ ]:
# list로 생성
import pandas as pd
list = [[1,2,3,4],[5,6,7,8]]
list
pd.DataFrame(list)

In [ ]:
# list로 생성, columnlumn 추가
pd.DataFrame(list, columns=['A','B','C','D'])

In [ ]:
# list로 생성, column 추가, indexex 추가
pd.DataFrame(list, columns=['A','B','C','D'], index=['one','two'])

In [ ]:
# array로 생성
arr = np.arange(12)
arr2 = arr.reshape(3,-1)
arr2
pd.DataFrame(arr2)

In [ ]:
# array로 생성, column추가, index 추가
pd.DataFrame(data=arr2, columns=['A','B','C','D'], index=['one','two','three'])

In [ ]:
# 딕셔너리로 생성
dic = {'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]}
dic

In [ ]:
# 딕셔너리로 생성, index 추가
pd.DataFrame(data=dic,index=['one','two','three'] )

* DataFrame을 넘파이 ndarray, list, 딕셔너리로 변환하기

In [ ]:
# DataFrame 생성
df = pd.DataFrame(data=dic,index=['one','two','three'] )
df

In [ ]:
# DataFrame을 딕셔너리로 변환
df.to_dict()

In [ ]:
# DataFrame을 ndarray로 변환
df.values

In [ ]:
# DataFrame을 list로 변환
df.values.tolist()

## Quiz 1

1) 아래 DataFrame을 딕셔너리로 생성하시오

In [ ]:
dict1=pd.DataFrame({'name':['kdh100','kdh101','kdh102','kdh103'],
             'jumin7':['990623-2','900303-2','681205-2','931226-2'],
             'sex':['F','F','F','F']})
dict1

### 2_2. Data Frame 읽기
* read_csv()** csv, txt, Excel Data 가능


* 데이터 읽어오기 pd.read_csv('file_name.csv')
- [데이터 읽어오기 참고(csv,txt,xlsx,UTF-8 인코딩)]
- df = pd.read_csv('file_name.csv')
- txt: 텍스트 파일. 특정 구분자로 구분되어있다면 sep 인자에 명시(탭(tab)은 sep='\t', '|' 는 sep='|'
- df = pd.read_csv('file_name.csv', encoding='cp949') - 한글파일 인코딩 에러시
- df = pd.read_csv('file_name.csv', sep='\t') - 구분자: Tab일때
                                        
- xlsx: 엑셀 파일. 특정 시트(sheet)의 데이터만 읽어올 경우 sheet_name 인자에 시트명 또는 순번을 입력해준다.
- df = pd.read_excel('file.xlsx')
- df = pd.read_excel('file.xlsx', sheet_name = 'first_sheet')

In [ ]:
import os
os.getcwd()

In [ ]:
# 파일 로딩 (hk_221206.csv), 절대경로/상대경로 (.\\, ..\\)
# df_hk = pd.read_csv('.\\data\\hk_221206.csv') # df_hk 라는 dataFrame명을 생성
df_hk = pd.read_csv('C://Users//김진산//Desktop//AIStudy/ktd_2_data230224/hk_221206.csv')

In [ ]:
# df_hk
df_hk

**head()와 tail()**

head()는 맨 앞부터 데이터 추출 (기본5개),    
tail()은 맨 뒤부터 데이터 추출 (기본5개)

In [ ]:
df_hk.head()

In [ ]:
df_hk.tail()

**DataFrame 출력 시 option**
* max_rows, max_columns, max_colwidth 설정

In [ ]:
pd.set_option('display.max_rows', 1000)
pd.set_option('display.max_columns', 1000)
pd.set_option('display.max_colwidth', 1000)
df_hk
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', 50)
pd.set_option('display.max_colwidth', 50)
df_hk

## Quiz 2

1) bike.csv를 읽고 column이 몇 개 인지 기술 하시오
 = 12개
2) iris.cvs를 읽고 row가 몇 개 인지 기술 하시오 
 = 150개
3) Online2.txt를 읽고 3번째 column이 무엇인지 기술 하시오
 = Description

In [ ]:
df_bike = pd.read_csv('c:ktd_2_data230224/bike.csv')
#df_bike.head()
#datetime	season	holiday	workingday	weather	temp	atemp	humidity	windspeed	casual	registered	count
#총 12개
df_iris = pd.read_csv('c:ktd_2_data230224/iris.csv')
#df_iris.tail()
#150개
df_Online2 = pd.read_csv('C:/Users/김진산/Desktop/AIStudy/ktd_2_data230224/Online2.txt',sep='\t')
df_Online2.head()

### 2_3. DataFrame 속성(attribute)
* df.ndim: 객체의 차원
* df.shape: 각 차원의 길이
* df.dtypes: 데이터 타입 dtype와 구별, 복수형이라야 함
* df.info(): 데이터 타입 정보 요약, 결측치 정보
* df.columns: column명
* df.describe(): 수치형 데이터 요약 정보

In [ ]:
# df.ndim: 객체의 차원
df_hk.ndim

In [ ]:
# df.shape: 각 차원의 길이
df_hk.shape

In [ ]:
# df.dtypes: 데이터 타입 dtype와 구별, 복수형이라야 함
df_hk.dtypes

In [ ]:
# df.info(): 데이터 타입 정보 요약, 결측치 정보
df_hk.info()

In [ ]:
# df.columns: column명
df_hk.columns

In [ ]:
# df.describe(): 수치형 데이터 요약 정보
df_hk.describe()

In [ ]:
# df.describe(): all 데이터 요약 정보
df_hk.describe(include='all')

### 2_4. Index와 Column 객체

In [ ]:
# 파일 로딩 
df_hk = pd.read_csv('c:ktd_2_data230224/hk_221206.csv')
df_hk.head()

In [ ]:
# Index, column 보기

In [ ]:
# Index 객체 추출
df_hk.index

In [ ]:
# Index 객체 추출 (전체)
df_hk.index.values

In [ ]:
# Index 객체 추출 (일부)
df_hk.index.values[:50]

In [ ]:
# column 객체 추출
df_hk.columns

In [ ]:
# column 객체 추출 (일부)
df_hk.columns[1:4]

In [ ]:
# column 내용 추출 (1개)
df_hk['age']

In [ ]:
# column 내용 추출 (2개 이상)
df_hk[['age','jumin7','company']]

## Quiz 3

1) bike.csv의 column을 전부 기술 하시오
['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count']
2) iris.cvs의 정수형 변수는 몇 개 인지 기술 하시오
0개

In [ ]:
# df_bike.columns
df_iris.info()

### 2_5. 함수 및 메소드
* df['age'].mean(): 평균값
* df['age'].median(): 중앙값
* df['age'].min(): 최소값
* df['age'].max(): 최대값
* df['age'].var(): 분산
* df['age'].std(): 표준편차
* df['age'].skew(): 왜도
* df['age'].kurt(): 첨도
* df['age'].count(): 개체수
* df['age'].quantile(q = 0.25) : 1사분위수

In [ ]:
# 수치형변수 함수 및 메소드
print( "df_hk['age'].min() : ", df_hk['age'].min())
print( "df_hk['age'].max() : ", df_hk['age'].max())
print( "df_hk['age'].var() : ", df_hk['age'].var())
print( "df_hk['age'].std() : ", df_hk['age'].std())
print( "df_hk['age'].skew() : ", df_hk['age'].skew())
print( "df_hk['age'].kurt() : ", df_hk['age'].kurt())

* df['blood_type'].nunique(): Column내 개별 데이터값 갯수
* df['blood_type'].unique(): Column내 개별 데이터값 내용
* df['blood_type'].value_counts(): Column내 개별 데이터값의 분포

  주의) default는 Null 값 제외, Null값 포함하려면 dropna를 True로 세팅

In [ ]:
# 명목형변수 함수 및 메소드
df_hk['blood_type'].unique()
df_hk['blood_type'].nunique()
df_hk['blood_type'].value_counts()

## Quiz 4

1) iris.cvs의 column('species')의 value_counts()를 구하시오
setosa        50
versicolor    50
virginica     50
2) Online2.txt의 column('Country')의 unique()를 구하시오
38개

In [ ]:
df_iris['species'].value_counts()
print(df_Online2['Country'].nunique())

### 2_6. column 생성, 수정, 삭제

In [ ]:
# column 생성
df_hk[:2]
df_hk['point'] = 0
df_hk.head(3)

In [ ]:
# column 수정
df_hk['point'] = df_hk['age']+10
df_hk.head()

**axis에 따른 삭제**

axis=1 일 경우 drop()은 column 방향으로 삭제

In [ ]:
# 1개 column 삭제
df_hk.drop('point', axis = 1, inplace=True)
df_hk

In [ ]:
# 2개 이상 column 삭제는 list로 입력. inplace=True일 경우 호출을 한 DataFrame에 drop결과가 직접 반영 
df_hk.drop(['age','gender','point'], axis = 1, inplace=True)
df_hk

In [ ]:
df_drop = df_hk

axis=0 일 경우 drop()은 row 방향으로 삭제

In [ ]:
# 1개 row 삭제
df_drop.drop([0,1,2,3],axis=0)

In [ ]:
# 2개 이상 row 삭제

column명 변경

In [ ]:
# rename
df_hk.rename(columns={'jumin7':'addr'})

In [ ]:
# df.columns
df_hk.columns = ['name','jumin7','height','blood_type','company','grade','salary','expe']
df_hk

## Quiz 5

1) iris.cvs의 column('sepal_length' , 'sepal_width')의 숫자 합을  파생변수 'sepal'로 생성하시오

In [ ]:
df_iris['sepal'] = df_iris['sepal_length'] + df_iris['sepal_width']
df_iris

### 2_7. 인덱싱 및 필터링

* DataFrame [ ] 로 row와 column을 인덱싱

In [ ]:
# 파일 로딩 
df_hk = pd.read_csv('c:ktd_2_data230224/hk_221206.csv')
df_hk.head()

In [ ]:
# []에 한개의 column만 입력하면 Series 객체를 반환  
df_hk['name']

In [ ]:
# []에 여러개 column을 list로 입력하면 column들로 구성된 DataFrame을 반환  
df_hk[['name','jumin7']]

In [ ]:
# []에 한개 index 정보를 입력하면 DataFrame을 반환  
df_hk[2:5]

In [ ]:
# []에 한개 index 정보를 입력하면 DataFrame을 반환  
df_hk[:2]

In [ ]:
# []에 index 정보입력 오류
# df_hk[3]

* iloc[ ] integer location : 위치기반 indexing

   [row정보, column정보] row, column 정보는 integer

In [ ]:
# iloc
df_hk.iloc[0:3 ,0:5 ]
df_hk.iloc[[0,3,5,6],[3,6,7]]

* loc[ ] location : 명칭기반 indexing (slice indexing)

   [row정보, column정보] column 정보는 column명

In [ ]:
# loc
df_hk.loc[0:3,'name':'age']
df_hk.loc[:,'salary']

In [ ]:
df_hk.loc[df_hk['age']>30,'salary':]

* boolean indexing

## Quiz 6

1) iris.cvs의 column('petal_width') 값이 1.0보다 큰 것은 몇개인지 구하시오
93개
2) bike.cvs의 column dtype이 'int64' 인것만 추출하고 DataFrame명을 'df_bike_int64'로 저장 하시오

In [ ]:
# df_iris.loc[df_iris['petal_width']>1.0,:]
df_bike_int64 = df_bike.loc[:,df_bike.dtypes== 'int64']
df_bike_int64

## Quiz 7

(실습문제 유형1을 사용하여, : indian_food2.csv (구분자: 쉼표(,), 255 행, 10 컬럼)

1) 단계 1-1. 지역(state) 컬럼을 제거하시오.

2) 단계 1-2. 조리 시간(cook_time)과 재료 준비 시간(prep_time)이 양수(>0)인 데이터만 추출하시오.

In [26]:
df_indian_food2 = pd.read_csv('c:ktd_2_data230224/indian_food2.csv')
df_indian_food2.head()
df_indian_food2 = df_indian_food2.drop('state', axis=1)
df_indian_food2.loc[(df_indian_food2['cook_time']>0) &(df_indian_food2['prep_time']>0)]

,id,name,ingredients,diet,prep_time,cook_time,flavor_profile,course,region
0,1,Balu shahi,"Maida flour, yogurt, oil, sugar",vegetarian,45,25,sweet,dessert,East
1,2,Boondi,"Gram flour, ghee, sugar",vegetarian,80,30,sweet,dessert,West
2,3,Gajar ka halwa,"Carrots, milk, sugar, ghee, cashews, raisins",vegetarian,15,60,sweet,dessert,North
3,4,Ghevar,"Flour, ghee, kewra, milk, clarified butter, su...",vegetarian,15,30,sweet,dessert,West
4,5,Gulab jamun,"Milk powder, plain flour, baking powder, ghee,...",vegetarian,15,40,sweet,dessert,East
...,...,...,...,...,...,...,...,...,...
247,248,Prawn malai curry,"Coconut milk, prawns, garlic, turmeric, sugar",non vegetarian,15,50,spicy,main course,East
249,250,Shukto,"Green beans, bitter gourd, ridge gourd, banana...",vegetarian,10,20,spicy,main course,East
250,251,Til Pitha,"Glutinous rice, black sesame seeds, gur",vegetarian,5,30,sweet,dessert,North East
251,252,Bebinca,"Coconut milk, egg yolks, clarified butter, all...",vegetarian,20,60,sweet,dessert,West
253,254,Mawa Bati,"Milk powder, dry fruits, arrowroot powder, all...",vegetarian,20,45,sweet,dessert,Central

### 2_8. 결손 데이터 처리하기
* isna(), dropna(), fillna()

In [28]:
# 파일 로딩 (hk_221206_na.csv)
df_hk_na = pd.read_csv('c:ktd_2_data230224/hk_221206_na.csv')
df_hk_na

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,NaN,NaN,A,A,NaN,1975
1,hkd10,900303-2,F,169.4,31.0,A,A,B,4720.0,2970
2,hkd100,681205-2,F,168.3,55.0,A,A,B,7280.0,5905
3,hkd101,931226-2,F,155.3,NaN,NaN,B,B,NaN,2935
4,hkd102,920123-1,M,188.6,NaN,NaN,B,F,NaN,4015
...,...,...,...,...,...,...,...,...,...,...
245,hkd95,730710-2,F,157.8,50.0,A,A,A,6990.0,4865
246,hkd96,720805-2,F,150.4,51.0,O,A,A,7110.0,4985
247,hkd97,710929-1,M,172.4,52.0,A,A,B,8000.0,6625
248,hkd98,701024-1,M,166.7,NaN,NaN,A,B,NaN,7385
249,hkd99,691115-2,F,152.6,54.0,B,A,B,7470.0,6095

In [31]:
# isna()
df_hk_na.isna().sum
df_hk_na.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         250 non-null    object
 1   jumin7       250 non-null    object
 2   gender       250 non-null    object
 3   height       250 non-null    float64
 4   age          234 non-null    float64
 5   blood_type   234 non-null    object
 6   company      250 non-null    object
 7   grades       250 non-null    object
 8   salary       234 non-null    float64
 9   expenditure  250 non-null    int64
dtypes: float64(3), int64(1), object(6)
memory usage: 19.7+ KB

In [36]:
# dropna()
df_hk_na.dropna(how='any')
df_hk_na.dropna(how='all')

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,NaN,NaN,A,A,NaN,1975
1,hkd10,900303-2,F,169.4,31.0,A,A,B,4720.0,2970
2,hkd100,681205-2,F,168.3,55.0,A,A,B,7280.0,5905
3,hkd101,931226-2,F,155.3,NaN,NaN,B,B,NaN,2935
4,hkd102,920123-1,M,188.6,NaN,NaN,B,F,NaN,4015
...,...,...,...,...,...,...,...,...,...,...
245,hkd95,730710-2,F,157.8,50.0,A,A,A,6990.0,4865
246,hkd96,720805-2,F,150.4,51.0,O,A,A,7110.0,4985
247,hkd97,710929-1,M,172.4,52.0,A,A,B,8000.0,6625
248,hkd98,701024-1,M,166.7,NaN,NaN,A,B,NaN,7385
249,hkd99,691115-2,F,152.6,54.0,B,A,B,7470.0,6095

In [37]:
df_hk_na.dropna(subset=['age','blood_type','salary'])

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
1,hkd10,900303-2,F,169.4,31.0,A,A,B,4720.0,2970
2,hkd100,681205-2,F,168.3,55.0,A,A,B,7280.0,5905
5,hkd103,910215-2,F,150.2,30.0,A,B,A,3290.0,1915
7,hkd105,980717-2,F,163.4,23.0,B,B,B,3080.0,1330
8,hkd106,970818-1,M,186.3,24.0,AB,B,C,3110.0,2360
...,...,...,...,...,...,...,...,...,...,...
244,hkd94,720614-1,M,174.1,49.0,O,A,B,8540.0,7165
245,hkd95,730710-2,F,157.8,50.0,A,A,A,6990.0,4865
246,hkd96,720805-2,F,150.4,51.0,O,A,A,7110.0,4985
247,hkd97,710929-1,M,172.4,52.0,A,A,B,8000.0,6625
249,hkd99,691115-2,F,152.6,54.0,B,A,B,7470.0,6095

In [43]:
# fillna()
df_hk_na['age'].fillna(20)
df_hk_na['age'].fillna((df_hk_na['age'].mean()))

0      39.337607
1      31.000000
2      55.000000
3      39.337607
4      39.337607
         ...
245    50.000000
246    51.000000
247    52.000000
248    39.337607
249    54.000000
Name: age, Length: 250, dtype: float64

In [45]:
df_hk_na['blood_type'].fillna('K')

0      K
1      A
2      A
3      K
4      K
      ..
245    A
246    O
247    A
248    K
249    B
Name: blood_type, Length: 250, dtype: object

## Quiz 8

(실습문제 유형5을 사용하여, : phone.csv (구분자:  “,” , 105,828 Rows, 10 Columns)

1) 단계 1-1. 데이터 중 테스트 결과(TestResult)가 SUCCESS이고 신호 강도(Signal) 값이 결측치(null, N/A 등)가 아닌 데이터만 추출

In [79]:
df_phone = pd.read_csv('c:ktd_2_data230224/phone.csv')
df_phone
df_phone.dropna(subset='Signal')

TypeError: Index(...) must be called with a collection of some kind, 'Signal' was passed

In [80]:
temp = df_phone.loc[df_phone['TestResult']=='SUCCESS',:]
temp.dropna(subset='Signal').info()

TypeError: Index(...) must be called with a collection of some kind, 'Signal' was passed

In [81]:
df_phone.loc[df_phone['TestResult'] == 'SUCCESS', :].dropna(subset = 'Signal').isna().sum()

TypeError: Index(...) must be called with a collection of some kind, 'Signal' was passed

### 2_9. sort, aggregation함수, groupby 

* sort_values()

In [82]:
# 파일 로딩
df_hk = pd.read_csv('c:ktd_2_data230224/hk_221206.csv')
df_hk.head()

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905
3,hkd101,931226-2,F,155.3,28,AB,B,B,4060,2935
4,hkd102,920123-1,M,188.6,29,O,B,F,4390,4015

In [86]:
# sort_values, 1개 column 정렬
df_hk.sort_values(by = ['blood_type','age'],ascending=False)

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
207,hkd60,681202-1,M,186.0,55,O,A,B,9440,8315
224,hkd76,681203-1,M,173.6,55,O,A,B,9120,7995
41,hkd136,690111-2,F,164.7,54,O,B,C,6440,5315
177,hkd33,691111-2,F,166.8,54,O,A,A,7520,5395
204,hkd58,701021-1,M,188.0,53,O,A,B,8000,6875
...,...,...,...,...,...,...,...,...,...,...
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
6,hkd104,990623-1,M,176.0,22,A,B,A,3750,2375
118,hkd205,990624-2,F,160.3,22,A,C,A,5040,2915
138,hkd223,990625-1,M,169.3,22,A,C,B,4970,3220
164,hkd247,000526-3,M,189.4,20,A,C,B,5540,4165

In [87]:
# n개 column 정렬  ['blood_type', 'age']
df_hk.sort_values(by = ['blood_type','age'],ascending=[True,False])

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905
42,hkd137,681231-1,M,182.9,55,A,B,B,8460,7335
178,hkd34,681201-1,M,179.6,55,A,A,C,9430,8680
231,hkd82,681204-1,M,174.0,55,A,A,B,9310,7935
205,hkd59,691112-1,M,174.2,54,A,A,B,8100,6975
...,...,...,...,...,...,...,...,...,...,...
206,hkd6,941105-2,F,156.3,27,O,A,F,4160,3785
9,hkd107,960909-1,M,181.8,25,O,B,B,3230,1480
121,hkd208,960910-2,F,165.8,25,O,C,B,5710,3960
141,hkd226,960911-1,M,172.4,25,O,C,B,5550,4425
184,hkd4,960809-1,M,177.6,25,O,A,B,4450,3075

In [ ]:
# n개 column 정렬, ascending(True/False) 적용
df_hk.sort_values(by = ['blood_type','age'],ascending=[True,False])

* aggregation (집계함수)

In [88]:
# 1개 column 에 대한 aggregation
df_hk['age'].mean()

39.24

In [90]:
# n개 column 에 대한 aggregation
df_hk[['age','salary']]
df_hk[['age','salary']].mean()

age         39.24
salary    6357.48
dtype: float64

In [94]:
# n개 column 에 대한 n개 aggregation
df_hk[['age','salary']].agg(['mean','median','max','min','count'])

           age    salary
mean     39.24   6357.48
median   39.00   6100.00
max      55.00  11990.00
min      20.00   3080.00
count   250.00    250.00

In [95]:
# n개 column 에 대한 column별 aggregation (dict형태로 입력)
df_hk[['age','salary']].agg({'age':'mean','salary':'median'})

age         39.24
salary    6100.00
dtype: float64

In [96]:
# 1개 column에 2개 이상 aggregation을 적용하면 마지막 aggregation이 적용
df_hk[['age','salary']].agg({'age':'mean','age':'max','salary':'median'})

age         55.0
salary    6100.0
dtype: float64

In [98]:
# 1개 column에 2개 이상 aggregation 적용 방법
df_hk[['age','salary']].agg(age_max=('age','max'),age_mean=('age','mean'))

            age
age_max   55.00
age_mean  39.24

* groupby()

In [104]:
# 1개 column 에 대한 groupby
df_hk[:10]
df_hk.groupby('company')['salary'].mean()
df_hk.groupby('company')['salary'].count()

company
A    100
B    100
C     50
Name: salary, dtype: int64

In [105]:
# n개 column 에 대한 groupby 
df_hk.groupby(['company','blood_type'])['salary','age'].mean()

                         salary        age
company blood_type
A       A           6635.294118  43.647059
        AB          6374.545455  42.272727
        B           6291.818182  42.590909
        O           6609.393939  43.636364
B       A           5383.235294  38.852941
        AB          5248.333333  37.500000
        B           5430.952381  39.476190
        O           5344.848485  38.878788
C       A           7725.625000  31.000000
        AB          7953.333333  32.000000
        B           8073.636364  31.727273
        O           8267.058824  33.176471

* groupby() + aggregation

In [106]:
# groupby
df_hk.groupby(['company','blood_type'])['salary','age'].mean()

                         salary        age
company blood_type
A       A           6635.294118  43.647059
        AB          6374.545455  42.272727
        B           6291.818182  42.590909
        O           6609.393939  43.636364
B       A           5383.235294  38.852941
        AB          5248.333333  37.500000
        B           5430.952381  39.476190
        O           5344.848485  38.878788
C       A           7725.625000  31.000000
        AB          7953.333333  32.000000
        B           8073.636364  31.727273
        O           8267.058824  33.176471

In [109]:
# n개 groupby + n개 aggregation(1개 column)
df_hk.groupby(['company','blood_type'])['age'].agg(['mean','max','median'])
df_hk.groupby(['company','blood_type']).age.agg(['mean','max','median'])

                         mean  max  median
company blood_type
A       A           43.647059   55    45.5
        AB          42.272727   54    43.0
        B           42.590909   54    43.0
        O           43.636364   55    45.0
B       A           38.852941   55    38.5
        AB          37.500000   51    38.0
        B           39.476190   50    40.0
        O           38.878788   54    38.0
C       A           31.000000   44    31.0
        AB          32.000000   42    33.0
        B           31.727273   41    32.0
        O           33.176471   45    34.0

In [113]:
# n개 groupby + n개 aggregation(column별 동일 aggregation)
df_hk.groupby(['company','blood_type'])['age','salary'].agg({'age':'mean','salary':'median'})

                          age  salary
company blood_type
A       A           43.647059  6725.0
        AB          42.272727  6530.0
        B           42.590909  5995.0
        O           43.636364  6610.0
B       A           38.852941  5400.0
        AB          37.500000  5370.0
        B           39.476190  6010.0
        O           38.878788  5160.0
C       A           31.000000  6915.0
        AB          32.000000  8490.0
        B           31.727273  7520.0
        O           33.176471  8050.0

In [ ]:
# n개 groupby + n개 aggregation(column별 다른 aggregation)
df_hk.groupby(['company','blood_type'])['age','salary'].agg({'age':'mean','salary':'median'})

## Quiz 9

1) iris.cvs의 column('species')별로 'sepal_length' , 'sepal_width')의 평균, 중앙값, 최대값을 구하시오

In [115]:
df_iris = pd.read_csv('c:ktd_2_data230224/iris.csv')
df_iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [132]:
df_iris.groupby(['species'])['sepal_length','sepal_width'].agg(['max','mean','median'])

           sepal_length               sepal_width
                    max   mean median         max   mean median
species
setosa              5.8  5.006    5.0         4.4  3.428    3.4
versicolor          7.0  5.936    5.9         3.4  2.770    2.8
virginica           7.9  6.588    6.5         3.8  2.974    3.0

### 2_10. DataFrame의 병합 (join)
* concat

In [135]:
# 파일 로딩
df_up = df_hk.iloc[:5,:]
df_up

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905
3,hkd101,931226-2,F,155.3,28,AB,B,B,4060,2935
4,hkd102,920123-1,M,188.6,29,O,B,F,4390,4015

In [138]:
df_down = df_hk.iloc[-5:,:]
df_down

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
245,hkd95,730710-2,F,157.8,50,A,A,A,6990,4865
246,hkd96,720805-2,F,150.4,51,O,A,A,7110,4985
247,hkd97,710929-1,M,172.4,52,A,A,B,8000,6625
248,hkd98,701024-1,M,166.7,53,O,A,B,8760,7385
249,hkd99,691115-2,F,152.6,54,B,A,B,7470,6095

In [146]:
df_left=df_hk.loc[:5,:'age']
df_left

     name    jumin7 gender  height  age
0    hkd1  990623-2      F   161.9   22
1   hkd10  900303-2      F   169.4   31
2  hkd100  681205-2      F   168.3   55
3  hkd101  931226-2      F   155.3   28
4  hkd102  920123-1      M   188.6   29
5  hkd103  910215-2      F   150.2   30

In [145]:
df_right = df_hk.loc[:5,'blood_type':]
df_right

  blood_type company grades  salary  expenditure
0          A       A      A    4100         1975
1          A       A      B    4720         2970
2          A       A      B    7280         5905
3         AB       B      B    4060         2935
4          O       B      F    4390         4015
5          A       B      A    3290         1915

In [147]:
pd.concat([df_up,df_down])

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905
3,hkd101,931226-2,F,155.3,28,AB,B,B,4060,2935
4,hkd102,920123-1,M,188.6,29,O,B,F,4390,4015
245,hkd95,730710-2,F,157.8,50,A,A,A,6990,4865
246,hkd96,720805-2,F,150.4,51,O,A,A,7110,4985
247,hkd97,710929-1,M,172.4,52,A,A,B,8000,6625
248,hkd98,701024-1,M,166.7,53,O,A,B,8760,7385
249,hkd99,691115-2,F,152.6,54,B,A,B,7470,6095

In [148]:
pd.concat([df_left,df_right],axis=1)

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905
3,hkd101,931226-2,F,155.3,28,AB,B,B,4060,2935
4,hkd102,920123-1,M,188.6,29,O,B,F,4390,4015
5,hkd103,910215-2,F,150.2,30,A,B,A,3290,1915

In [ ]:
# concat (row), axis = 0 default

In [ ]:
# concat (column)  axis = 1

* merge

In [149]:
# merge 실습 파일 생성
df_a = df_hk.iloc[:5,:2]
df_b = df_hk.iloc[3:7,:3]

In [150]:
df_a

     name    jumin7
0    hkd1  990623-2
1   hkd10  900303-2
2  hkd100  681205-2
3  hkd101  931226-2
4  hkd102  920123-1

In [151]:
df_b

     name    jumin7 gender
3  hkd101  931226-2      F
4  hkd102  920123-1      M
5  hkd103  910215-2      F
6  hkd104  990623-1      M

In [152]:
# merge  (inner join default)
pd.merge(left=df_a,right=df_b, left_on='name',right_on='name', how='inner')

     name  jumin7_x  jumin7_y gender
0  hkd101  931226-2  931226-2      F
1  hkd102  920123-1  920123-1      M

In [153]:
# merge   (left join)
pd.merge(left=df_a,right=df_b, left_on='name',right_on='name', how='left')

     name  jumin7_x  jumin7_y gender
0    hkd1  990623-2       NaN    NaN
1   hkd10  900303-2       NaN    NaN
2  hkd100  681205-2       NaN    NaN
3  hkd101  931226-2  931226-2      F
4  hkd102  920123-1  920123-1      M

In [154]:
# merge   (outer join)
pd.merge(left=df_a,right=df_b, left_on='name',right_on='name', how='outer')

     name  jumin7_x  jumin7_y gender
0    hkd1  990623-2       NaN    NaN
1   hkd10  900303-2       NaN    NaN
2  hkd100  681205-2       NaN    NaN
3  hkd101  931226-2  931226-2      F
4  hkd102  920123-1  920123-1      M
5  hkd103       NaN  910215-2      F
6  hkd104       NaN  990623-1      M

### 2_11. column내 값 변경
* replace
* map

In [155]:
# 파일로딩
df_hk[:2]

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970

In [157]:
# replace (1개 값 변경)
df_hk['gender'].replace({'F':'female','M':'male'})

0      female
1      female
2      female
3      female
4        male
        ...
245    female
246    female
247      male
248      male
249    female
Name: gender, Length: 250, dtype: object

In [158]:
# replace (n개 값 변경)
df_hk['gender'].replace({'F':'female','M':'male'})

0      female
1      female
2      female
3      female
4        male
        ...
245    female
246    female
247      male
248      male
249    female
Name: gender, Length: 250, dtype: object

In [159]:
# map (n개 값 변경)
df_hk['gender'].map({'F':'female','M':'male'})

0      female
1      female
2      female
3      female
4        male
        ...
245    female
246    female
247      male
248      male
249    female
Name: gender, Length: 250, dtype: object

### 2_12. apply lambda 식으로 데이터 가공

In [160]:
# 파일 로딩 
df_hk[:2]

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970

In [164]:
# apply lambda
df_hk['name'].apply(lambda x:x[3:])

0        1
1       10
2      100
3      101
4      102
      ...
245     95
246     96
247     97
248     98
249     99
Name: name, Length: 250, dtype: object

In [174]:
df_hk['birth_day'] = df_hk['jumin7'].apply(lambda x: '19' + x[:6]).astype(int)
df_hk['birth_day'] = df_hk['jumin7'].apply(lambda x: '19' + x[:6]).astype("datetime64")
df_hk

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure,birth_day
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975,1999-06-23
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970,1990-03-03
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905,1968-12-05
3,hkd101,931226-2,F,155.3,28,AB,B,B,4060,2935,1993-12-26
4,hkd102,920123-1,M,188.6,29,O,B,F,4390,4015,1992-01-23
...,...,...,...,...,...,...,...,...,...,...,...
245,hkd95,730710-2,F,157.8,50,A,A,A,6990,4865,1973-07-10
246,hkd96,720805-2,F,150.4,51,O,A,A,7110,4985,1972-08-05
247,hkd97,710929-1,M,172.4,52,A,A,B,8000,6625,1971-09-29
248,hkd98,701024-1,M,166.7,53,O,A,B,8760,7385,1970-10-24
249,hkd99,691115-2,F,152.6,54,B,A,B,7470,6095,1969-11-15

### 2_13. 값 등급화, 분류
* np.where
* cut

In [177]:
# np.where 2개
# np.where(조건, True, False)
np.where(df_hk['age'] < 30,'30미만'   ,'30이상'   )[:5]

array(['30미만', '30이상', '30이상', '30미만', '30미만'], dtype='<U4')

In [178]:
# np.where 3개
# np.where(조건1, True, False)
# np.where(조건1, True, 
#                 np.where(조건2, True, False)
np.where(df_hk['age'] < 30,'30미만'   ,
        np.where(df_hk['age'] < 40,'40미만','50대 이상'))[:5]

array(['30미만', '40미만', '50대 이상', '30미만', '30미만'], dtype='<U6')

In [180]:
# cut

pd.cut(x = df_hk['age'], bins = [0,20,30,40,100], labels = ['10대', '20대', '30대', '40대이상'])

0        20대
1        30대
2      40대이상
3        20대
4        20대
       ...
245    40대이상
246    40대이상
247    40대이상
248    40대이상
249    40대이상
Name: age, Length: 250, dtype: category
Categories (4, object): ['10대' < '20대' < '30대' < '40대이상']

### 2_14. 날짜 변수 처리 (datetime)

In [181]:
import datetime

In [184]:
df_hk = df_hk.drop('birth_day', axis=1)

KeyError: "['birth_day'] not found in axis"

In [185]:
df_hk.head()

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905
3,hkd101,931226-2,F,155.3,28,AB,B,B,4060,2935
4,hkd102,920123-1,M,188.6,29,O,B,F,4390,4015

In [189]:
# pd.to_datetime
df_hk['birth_day'] = pd.to_datetime(df_hk['jumin7'],format='%y%m%d-%w')
df_hk

,name,jumin7,gender,height,age,blood_type,company,grades,salary,expenditure,birth_day
0,hkd1,990623-2,F,161.9,22,A,A,A,4100,1975,1999-06-23
1,hkd10,900303-2,F,169.4,31,A,A,B,4720,2970,1990-03-03
2,hkd100,681205-2,F,168.3,55,A,A,B,7280,5905,2068-12-05
3,hkd101,931226-2,F,155.3,28,AB,B,B,4060,2935,1993-12-26
4,hkd102,920123-1,M,188.6,29,O,B,F,4390,4015,1992-01-23
...,...,...,...,...,...,...,...,...,...,...,...
245,hkd95,730710-2,F,157.8,50,A,A,A,6990,4865,1973-07-10
246,hkd96,720805-2,F,150.4,51,O,A,A,7110,4985,1972-08-05
247,hkd97,710929-1,M,172.4,52,A,A,B,8000,6625,1971-09-29
248,hkd98,701024-1,M,166.7,53,O,A,B,8760,7385,1970-10-24
249,hkd99,691115-2,F,152.6,54,B,A,B,7470,6095,1969-11-15

In [ ]:
# astype('datetime64')

In [187]:
# datetime.datetime.strptime
df_hk['jumin7'].apply(lambda x : x[0:6]).apply(lambda x : datetime.datetime.strptime(x, '%y%m%d'))

0     1999-06-23
1     1990-03-03
2     2068-12-05
3     1993-12-26
4     1992-01-23
         ...
245   1973-07-10
246   1972-08-05
247   1971-09-29
248   1970-10-24
249   1969-11-15
Name: jumin7, Length: 250, dtype: datetime64[ns]

In [197]:
# datetime 활용
df_hk['birth_day'].dt.year
df_hk['birth_day'].dt.month
df_hk['birth_day'].dt.day
df_hk['birth_day'].dt.weekday
df_hk['birth_day'].dt.day_name()

0      Wednesday
1       Saturday
2      Wednesday
3         Sunday
4       Thursday
         ...
245      Tuesday
246     Saturday
247    Wednesday
248     Saturday
249     Saturday
Name: birth_day, Length: 250, dtype: object

Quiz 7 (실습문제 유형5을 사용하여, : phone.csv (구분자: “,” , 105,828 Rows, 10 Columns)

1) 단계 1-1. 데이터 중 테스트 결과(TestResult)가 SUCCESS이고 신호 강도(Signal) 값이 결측치(null, N/A 등)가 아닌 데이터만 추출

In [ ]:
# 파일 로딩

In [ ]:
# 단계 1-1. 데이터 중 테스트 결과(TestResult)가 SUCCESS

In [ ]:
# 신호 강도(Signal) 값이 결측치(null, N/A 등)가 아닌 데이터만 추출